const baseTime = Date.now();

export const moviesData = [
  {
    id: baseTime + 1,
    name: "Начало",
    description:
      "Опытный вор проникает в сны людей, чтобы украсть или внедрить идеи.",
    rating: 8.8,
  },
  {
    id: baseTime + 2,
    name: "Побег из Шоушенка",
    description:
      "Два заключённых находят надежду и дружбу в суровых тюремных условиях.",
    rating: 9.3,
  },
  {
    id: baseTime + 3,
    name: "Тёмный рыцарь",
    description:
      "Бэтмен сражается с Джокером, который бросает вызов порядку в Готэме.",
    rating: 9.0,
  },
  {
    id: baseTime + 4,
    name: "Интерстеллар",
    description:
      "Команда исследователей путешествует через червоточину в поисках нового дома для человечества.",
    rating: 8.6,
  },
  {
    id: baseTime + 5,
    name: "Матрица",
    description:
      "Хакер узнаёт, что реальный мир — это лишь иллюзия, созданная машинами.",
    rating: 8.7,
  },
  {
    id: baseTime + 6,
    name: "Бойцовский клуб",
    description:
      "Офисный работник создаёт подпольный бойцовский клуб для борьбы с рутиной.",
    rating: 8.8,
  },
  {
    id: baseTime + 7,
    name: "Форрест Гамп",
    description:
      "История добродушного Форреста, чья простота не мешает ему менять мир вокруг.",
    rating: 8.8,
  },
  {
    id: baseTime + 8,
    name: "Остров проклятых",
    description:
      "Два маршала расследуют исчезновение пациентки из психиатрической клиники.",
    rating: 8.2,
  },
  {
    id: baseTime + 9,
    name: "Зелёная миля",
    description:
      "Охранник тюрьмы знакомится с необычным заключённым, обладающим мистическими способностями.",
    rating: 8.6,
  },
  {
    id: baseTime + 10,
    name: "1+1",
    description:
      "Трогательная история дружбы между парализованным аристократом и его помощником из неблагополучного района.",
    rating: 8.5,
  },
];

export default moviesData;
